tutorials/Force_validation(channel)/Force_validation(channel)/constant/porosityDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porosityDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
useTransient    false; 
KC              10000.0; 
a               2( 0  2000);  
b               2( 0  1.2);    
c               2( 0  0.34);  

D50             2( 1  0.03);  
porosity        2( 1  0.5);   

// ************************************************************************* //
