tutorials/Force_validation(channel)/Force_validation(channel)/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat       raw;

surfaceFormat   raw;

sets
(

    Gauge0
    {
        type         midPointAndFace;
        axis         z;
        start        ( -0.5 0.001 0.2 ); 
        end          ( -0.5 0.001 0.6 );
        nPoints      50;
    }
 
    Gauge1
    {
        type         midPointAndFace;
        axis         z;
        start        ( -0.75 0.001 0.2 ); 
        end          ( -0.75 0.001 0.6 );
        npoints      50;
    }

    Gauge2
    {
        type         midPointAndFace;
        axis         z;
        start        ( 0.5 0.001 0.2 ); 
        end          ( 0.5 0.001 0.6 );
        npoints      50;
    }

    Gauge3
    {
        type         midPointAndFace;
        axis         z;
        start        ( 0.75 0.001 0.2 ); 
        end          ( 0.75 0.001 0.6 );
        npoints      50;
    }
 

    

);


surfaces        ();

fields          ( p_rgh );

type sets;

libs ("libsampling.so");

writeControl    adjustableRunTime;
writeInterval   0.01;
